package com.mishou.demo.bean;

import com.mishou.common.net.model.ApiResult;

/**
 * Created by ${shishoufeng} on 17/11/17.
 * email:shishoufeng1227@126.com
 */

public class HistoryData<T> extends ApiResult<T>{


    /**
     * reason : success
     * result : [{"day":"11/17","date":"1019年11月17日","title":"北宋史学家司马光诞辰","e_id":"12873"},{"day":"11/17","date":"1612年11月17日","title":"多尔衮诞辰","e_id":"12874"},{"day":"11/17","date":"1717年11月17日","title":"法国著名学者达兰贝尔诞辰","e_id":"12875"},{"day":"11/17","date":"1727年11月17日","title":"隆科多以大罪五十永远禁锢","e_id":"12876"},{"day":"11/17","date":"1828年11月17日","title":"中国近代早期改良主义者容闳诞辰","e_id":"12877"},{"day":"11/17","date":"1843年11月17日","title":"上海开埠，中外贸易中心逐渐从广州移到上海","e_id":"12878"},{"day":"11/17","date":"1858年11月17日","title":"英国空想社会主义者罗伯特·欧文逝世","e_id":"12879"},{"day":"11/17","date":"1869年11月17日","title":"苏伊士运河竣工通航","e_id":"12880"},{"day":"11/17","date":"1887年11月17日","title":"英国陆军元帅蒙哥马利出生","e_id":"12881"},{"day":"11/17","date":"1905年11月17日","title":"日韩保护条约订立","e_id":"12882"},{"day":"11/17","date":"1917年11月17日","title":"法国雕塑家奥杰斯特·罗丹逝世","e_id":"12883"},{"day":"11/17","date":"1920年11月17日","title":"弗兰格尔白卫军被粉碎","e_id":"12884"},{"day":"11/17","date":"1933年11月17日","title":"美国正式承认苏联","e_id":"12885"},{"day":"11/17","date":"1937年11月17日","title":"第一座由中国人自己修建的钱塘江大桥开通","e_id":"12886"},{"day":"11/17","date":"1956年11月17日","title":"邓小平说，马列主义要与中国的实际情况相结合","e_id":"12887"},{"day":"11/17","date":"1957年11月17日","title":"我国运动员郑凤荣创女子跳高世界纪录","e_id":"12888"},{"day":"11/17","date":"1957年11月17日","title":"毛主席说：\u201c世界是你们的\u201d","e_id":"12889"},{"day":"11/17","date":"1968年11月17日","title":"百度公司创始人李彦宏出生","e_id":"12890"},{"day":"11/17","date":"1969年11月17日","title":"美苏开始第一阶段战略武器谈判","e_id":"12891"},{"day":"11/17","date":"1983年11月17日","title":"英国体育大臣要求各国判\u201c足球流氓\u201d入狱干苦役","e_id":"12892"},{"day":"11/17","date":"1983年11月17日","title":"法国\u201c超级军旗\u201d飞机轰炸贝卡谷地","e_id":"12893"},{"day":"11/17","date":"1984年11月17日","title":"中央要求严格控制成立全国性组织","e_id":"12894"},{"day":"11/17","date":"1986年11月17日","title":"美苏军备控制谈判将举行临时会谈","e_id":"12895"},{"day":"11/17","date":"1989年11月17日","title":"我国首台小巨型电子计算机问世","e_id":"12896"},{"day":"11/17","date":"1990年11月17日","title":"赣江流域发现商代大墓","e_id":"12897"},{"day":"11/17","date":"1991年11月17日","title":"中国灭火队赴科威特灭火胜利凯旋","e_id":"12898"},{"day":"11/17","date":"1991年11月17日","title":"美发现地球上最大头骨化石","e_id":"12899"},{"day":"11/17","date":"1992年11月17日","title":"我国著名作家路遥逝世","e_id":"12900"},{"day":"11/17","date":"1993年11月17日","title":"莫斯科列宁博物馆关闭","e_id":"12901"},{"day":"11/17","date":"1995年11月17日","title":"联合国秘书长加利与太空中宇航员互致问候","e_id":"12902"},{"day":"11/17","date":"1997年11月17日","title":"历时五年耗巨资 温莎古堡修复完毕","e_id":"12903"},{"day":"11/17","date":"1997年11月17日","title":"埃及发生枪击外国游客事件","e_id":"12904"},{"day":"11/17","date":"1998年11月17日","title":"中国第一次网络直播天文奇观","e_id":"12905"},{"day":"11/17","date":"1998年11月17日","title":"上海宝钢集团公司正式成立","e_id":"12906"},{"day":"11/17","date":"2001年11月17日","title":"中科院北京市共建中关村科学城","e_id":"12907"},{"day":"11/17","date":"2009年11月17日","title":"美国总统奥巴马访华","e_id":"12908"},{"day":"11/17","date":"2009年11月17日","title":"考古学家首次发现描绘普通人日常生活玛雅壁画","e_id":"12909"},{"day":"11/17","date":"2014年11月17日","title":"沪港通正式开闸","e_id":"12910"},{"day":"11/17","date":"2015年11月17日","title":"\u201c1·09\u201d特大网络赌博案","e_id":"12911"}]
     * error_code : 0
     */

    public String reason;
    public int error_code;
    public T result;


    @Override
    public T getData() {
        return result;
    }


    @Override
    public int getCode() {
        return error_code;
    }


    @Override
    public String getMsg() {
        return reason;
    }

    @Override
    public boolean isOk() {
        return error_code == 0;
    }
}
